microsoft/uf2-samdx1/lib/samd21/samd21a/atdf/ATSAMD21G17AU.atdf
        <register name="XOSC32K" offset="0x14" rw="RW" size="2" initval="0x0080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="AAMPEN" caption="Automatic Amplitude Control Enable" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="32kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="1" initval="0x1F" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
        <register name="OSC8M" offset="0x20" rw="RW" size="4" initval="0x87070382" caption="8MHz Internal Oscillator (OSC8M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="PRESC" caption="Oscillator Prescaler" mask="0x300" values="SYSCTRL_OSC8M__PRESC"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0xFFF0000"/>
          <bitfield name="FRANGE" caption="Oscillator Frequency Range" mask="0xC0000000" values="SYSCTRL_OSC8M__FRANGE"/>
        </register>
        <register name="DFLLCTRL" offset="0x24" rw="RW" access="WSYNC" size="2" initval="0x0080" caption="DFLL48M Control">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
        </register>
        <register name="DFLLVAL" offset="0x28" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x30" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="BOD33" offset="0x34" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="3.3V Brown-Out Detector (BOD33) Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis" mask="0x4"/>
          <bitfield name="ACTION" caption="BOD33 Action" mask="0x18" values="SYSCTRL_BOD33__ACTION"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="MODE" caption="Operation Mode" mask="0x100"/>
          <bitfield name="CEN" caption="Clock Enable" mask="0x200"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SYSCTRL_BOD33__PSEL"/>
          <bitfield name="LEVEL" caption="BOD33 Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x3C" rw="RW" size="2" initval="0x0000" caption="Voltage Regulator System (VREG) Control">
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="FORCELDO" caption="Force LDO Voltage Regulator" mask="0x2000"/>
        </register>
        <register name="VREF" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Voltage References System (VREF) Control">
          <bitfield name="TSEN" caption="Temperature Sensor Enable" mask="0x2"/>
          <bitfield name="BGOUTEN" caption="Bandgap Output Enable" mask="0x4"/>
          <bitfield name="CALIB" caption="Bandgap Voltage Generator Calibration" mask="0x7FF0000"/>
        </register>
        <register name="DPLLCTRLA" offset="0x44" rw="RW" size="1" initval="0x80" caption="DPLL Control A">
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Clock Activation" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
